Autodesk.Revit.DB.FormatOptions.CanUsePlusPrefix
Checks whether a plus prefix can be displayed for the display unit in this FormatOptions.
Returns:
True if a plus prefix can be displayed, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanUsePlusPrefix(Autodesk.Revit.DB.DisplayUnitType)
Checks whether a plus prefix can be displayed for a given display unit.
displayUnit:
The display unit.
Returns:
True if a plus prefix can be displayed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanSuppressSpaces
Checks whether spaces can be suppressed for the display unit in this FormatOptions.
Returns:
True if spaces can be suppressed, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanSuppressSpaces(Autodesk.Revit.DB.DisplayUnitType)
Checks whether spaces can be suppressed for a given display unit.
displayUnit:
The display unit.
Returns:
True if spaces can be suppressed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanSuppressLeadingZeros
Checks whether leading zeros can be suppressed for the display unit in this FormatOptions.
Returns:
True if leading zeros can be suppressed, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanSuppressLeadingZeros(Autodesk.Revit.DB.DisplayUnitType)
Checks whether leading zeros can be suppressed for a given display unit.
displayUnit:
The display unit.
Returns:
True if leading zeros can be suppressed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanSuppressTrailingZeros
Checks whether trailing zeros can be suppressed for the display unit in this FormatOptions.
Returns:
True if trailing zeros can be suppressed, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanSuppressTrailingZeros(Autodesk.Revit.DB.DisplayUnitType)
Checks whether trailing zeros can be suppressed for a given display unit.
displayUnit:
The display unit.
Returns:
True if trailing zeros can be suppressed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.IsValidAccuracy(System.Double)
Checks whether an accuracy is valid for the display unit in this FormatOptions.
Remarks:
See the Accuracy property for details on
valid accuracy values.
accuracy:
The accuracy to check.
Returns:
True if the accuracy is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.IsValidAccuracy(Autodesk.Revit.DB.DisplayUnitType,System.Double)
Checks whether an accuracy is valid for a given display unit.
Remarks:
See the Accuracy property for details on
valid accuracy values.
displayUnit:
The display unit.
accuracy:
The accuracy to check.
Returns:
True if the accuracy is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.GetValidUnitSymbols
Gets all valid unit symbols for the display unit in this FormatOptions.
Returns:
The valid unit symbols.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.GetValidUnitSymbols(Autodesk.Revit.DB.DisplayUnitType)
Gets all valid unit symbols for a given display unit.
displayUnit:
The display unit.
Returns:
The valid unit symbols.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.IsValidUnitSymbol(Autodesk.Revit.DB.UnitSymbolType)
Checks whether a unit symbol is valid for the display unit in this FormatOptions.
unitSymbol:
The unit symbol to check.
Returns:
True if the unit symbol is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.IsValidUnitSymbol(Autodesk.Revit.DB.DisplayUnitType,Autodesk.Revit.DB.UnitSymbolType)
Checks whether a unit symbol is valid for a given display unit.
displayUnit:
The display unit.
unitSymbol:
The unit symbol to check.
Returns:
True if the unit symbol is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanHaveUnitSymbol
Checks whether a unit symbol can be specified for the display unit in this FormatOptions.
Returns:
True if a unit symbol can be specified, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.CanHaveUnitSymbol(Autodesk.Revit.DB.DisplayUnitType)
Checks whether a unit symbol can be specified for a given display unit.
displayUnit:
The display unit.
Returns:
True if a unit symbol can be specified, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.IsValidForUnitType(Autodesk.Revit.DB.UnitType)
Checks whether this FormatOptions is valid for a given unit type.
Remarks:
The FormatOptions is valid if UseDefault is true or if the display
unit in the FormatOptions is valid for the unit type.  See
UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType)
and
UnitUtils.GetValidDisplayUnits(UnitType).
unitType:
The unit type.
Returns:
True if the FormatOptions is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormatOptions.RoundingMethod
The method used to round values: round to nearest, round up, or round down.
Remarks:
The RoundingMethod property is currently only supported for rebar parameters.
A FormatOptions object containing any rounding method may be returned by Element.GetParameterFormatOptions() and may be passed to the formatting and parsing utilities in the UnitFormatUtils class.
FormatOptions objects used in other contexts must contain the default rounding method (Nearest).
The rounding method.  The default is Nearest.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2016

Autodesk.Revit.DB.FormatOptions.UseDigitGrouping
Indicates if digit grouping symbols should be displayed.
Remarks:
When UseDigitGrouping is true, digit grouping symbols (i.e.
thousands separators) will be displayed when needed.  For example,
123456789.00 may be displayed as 123,456,789.00.  The precise
display is determined by the DigitGroupingSymbol and
DigitGroupingAmount properties of the Units class.
True if digit grouping symbols should be displayed, false otherwise.  The default is false.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.UsePlusPrefix
Indicates if a plus sign prefix should be displayed for positive and zero values.
Remarks:
This property is applicable to length display units (e.g.
meters or feet).  It is not currently supported for other unit
types like area or force.  The UI also does not permit it to be
enabled in the Units class that represents the document's default
settings, but that restriction is not enforced in the API.
When UsePlusPrefix is true, a plus sign ("+") will be
displayed before positive and zero values, just as a minus sign
("-") is displayed before negative values.  For example, 1.234 will
be displayed as +1.234 and 0.0 will be displayed as +0.0.
True if a plus prefix should be displayed, false otherwise.  The default is false.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
-or-
When setting this property: UsePlusPrefix was set to true but a plus prefix cannot be displayed for the display unit in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.SuppressSpaces
Indicates if spaces around the dash should be suppressed in feet and fractional inches.
Remarks:
This property is applicable to display units related to feet
and fractional inches:
DUT_FEET_FRACTIONAL_INCHES
DUT_RISE_OVER_FOOT
DUT_RISE_OVER_10_FEET
When SuppressLeadingZeros is true, spaces will not be
inserted before and after the dash separating feet from
inches.  For example, 1' - 2 3/4" will be displayed as
1'-2 3/4".
True if spaces should be suppressed, false otherwise.  The default is false.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
-or-
When setting this property: SuppressSpaces was set to true but spaces cannot be suppressed for the display unit in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.SuppressLeadingZeros
Indicates if leading zeros should be suppressed in feet and fractional inches.
Remarks:
This property is applicable to display units related to feet
and fractional inches:
DUT_FEET_FRACTIONAL_INCHES
DUT_RISE_OVER_FOOT
DUT_RISE_OVER_10_FEET
When SuppressLeadingZeros is true:
If the foot component of the value is zero (the value is less
than one foot), it will not be displayed.  For example, 0' - 2 3/4"
will be displayed as 2 3/4".
If both the foot and integer inch components of the value are
zero (the value is less than one inch), neither will be displayed.
For example, 0' - 0 3/4" will be displayed as 3/4".
However, an integer inch component of zero will be displayed
if the foot component is non-zero.  For example 1' - 0 3/4" will be
displayed as 1' - 0 3/4".
True if leading zeros should be suppressed, false otherwise.  The default is false.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
-or-
When setting this property: SuppressLeadingZeros was set to true but leading zeros cannot be suppressed for the display unit in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.SuppressTrailingZeros
Indicates if trailing zeros after the decimal point should be
suppressed.
Remarks:
This property is applicable to display units which are
formatted as a decimal number.  It is not applicable to the
following display units which have specialized formatting:
DUT_GENERAL
DUT_FEET_FRACTIONAL_INCHES
DUT_FRACTIONAL_INCHES
DUT_METERS_CENTIMETERS
DUT_DEGREES_AND_MINUTES
DUT_RISE_OVER_INCHES
DUT_RISE_OVER_120_INCHES
DUT_RISE_OVER_FOOT
DUT_RISE_OVER_10_FEET
When SuppressTrailingZeros is true, trailing zeros to the
right of the decimal point will not be displayed.  For example,
1.200 will be displayed as 1.2.
Trailing zeros are always suppressed for DUT_GENERAL, and the
SuppressTrailingZeros property is not used.
True if trailing zeros should be suppressed, false otherwise.  The default is false.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
-or-
When setting this property: SuppressTrailingZeros was set to true but trailing zeros cannot be suppressed for the display unit in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.Accuracy
The accuracy to which values will be rounded.
Remarks:
Formatted values will be rounded to the nearest multiple of
the accuracy value.
Accuracy is specified in display units, not in Revit's
internal units.
For DUT_GENERAL, the accuracy value is always 0.000001 and
cannot be set to another value.  DUT_GENERAL is a special display
unit that always rounds to six decimal places and suppresses
trailing zeros, roughly equivalent to DUT_FIXED with the accuracy
set to 0.000001 and SuppressTrailingZeros set to true.
For other display units, a wide range of accuracy values may
be specified.  All values from 1.0e-12 to 1.0e12 will be accepted,
but the specified value will be automatically adjusted to the
nearest supported value if necessary.  For best results, the
accuracy value should be chosen to be compatible with the display
unit:
For most display units, the value is displayed as a decimal
number, and the accuracy should typically be a power of 10, for
example 1.0 to round to 0 decimal places or 0.001 to round to 3
decimal places.  Other values can be used, for example 0.25 to
round to the nearest 0.25 (displayed with 2 decimal places) or
2.0 to round to the nearest even integer (displayed with 0 decimal
places).  The specified accuracy will automatically be rounded to
the nearest positive multiple of 1.0e-12.
For DUT_FRACTIONAL_INCHES, DUT_RISE_OVER_INCHES, and
DUT_RISE_OVER_120_INCHES, the accuracy should typically be a power
of 2, for example 0.25 to round to the nearest 1/4".  Other values
can be used, for example 6.0 to round to the nearest 6" or 1.5 to
round to the nearest 1 1/2".  For DUT_FEET_FRACTIONAL_INCHES,
DUT_RISE_OVER_FOOT, and DUT_RISE_OVER_10_FEET, similar accuracy
values can be used but they must be divided by 12 because the
accuracy is specified in feet.  The specified accuracy will
automatically be rounded to the nearest positive multiple of
1/2^20 inches.
For DUT_DEGREES_AND_MINUTES, the accuracy should typically
be a power of 10 divided by 3600 to round seconds to a specific
number of decimal places, for example 1.0 / 3600.0 to round seconds
to 0 decimal places or 0.01 / 3600.0 to round seconds to 2 decimal
places.  The specified accuracy will automatically be rounded to
the nearest positive multiple of 1.0e-8 seconds.
The accuracy.  The default depends on the display unit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: accuracy is not a valid accuracy for the display unit in this FormatOptions.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.UnitSymbol
The unit symbol that should be displayed to indicate the units of the value.
The unit symbol.  The default is UST_NONE.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: unitSymbol is not a valid unit symbol for the display unit in this FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.DisplayUnits
The units and display format used to format values.
Remarks:
Most display units represent simple units like meters, square feet,
or degrees, and are formatted as decimal numbers.  Some display
units represent specialized formatting methods like "feet and
fractional inches" or "degrees, minutes and seconds".
The display unit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
UseDefault is true in this FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatOptions.UseDefault
Indicates whether default or custom formatting should be used.
Remarks:
If UseDefault is true, formatting will be according to the default
settings in the Units class, and none of the other settings in the
object are meaningful.  If UseDefault is false, the object contains
custom settings that override the default settings in the Units
class.  UseDefault is always false for FormatOptions objects in the
Units class.
True if default formatting should be used; false if custom formatting should be used.
Since:
2014

Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.FormatOptions)
Creates a copy of a FormatOptions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.DisplayUnitType,Autodesk.Revit.DB.UnitSymbolType,System.Double)
Creates a new FormatOptions object that represents custom formatting.
displayUnit:
The display unit.
unitSymbol:
The unit symbol.
accuracy:
The accuracy.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
-or-
unitSymbol is not a valid unit symbol for displayUnit.
-or-
accuracy is not a valid accuracy for displayUnit.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.DisplayUnitType,System.Double)
Creates a new FormatOptions object that represents custom formatting.
displayUnit:
The display unit.
accuracy:
The accuracy.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
-or-
accuracy is not a valid accuracy for displayUnit.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.DisplayUnitType,Autodesk.Revit.DB.UnitSymbolType)
Creates a new FormatOptions object that represents custom formatting.
displayUnit:
The display unit.
unitSymbol:
The unit symbol.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
-or-
unitSymbol is not a valid unit symbol for displayUnit.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.#ctor(Autodesk.Revit.DB.DisplayUnitType)
Creates a new FormatOptions object that represents custom formatting.
displayUnit:
The display unit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
displayUnit is an invalid display unit.  See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.FormatOptions.#ctor
Creates a new FormatOptions object that represents default formatting.
Since:
2014

Autodesk.Revit.DB.FormatOptions
Options for formatting numbers with units.
Remarks:
The FormatOptions class contains settings that control how to
format numbers with units as strings.  It contains those settings that
are typically chosen by an end user in the Format dialog and stored in
the document.
The FormatOptions class is used in two different ways.  A
FormatOptions object in the Units class
represents the default settings for the document.  A FormatOptions
object used elsewhere represents settings that may optionally override
the default settings.
The UseDefault property controls
whether a FormatOptions object represents default or custom
formatting.  If UseDefault is true, formatting will be according to
the default settings in the Units class, and none of the other
settings in the object are meaningful.  If UseDefault is false, the
object contains custom settings that override the default settings in
the Units class.  UseDefault is always false for FormatOptions objects
in the Units class.
Since:
2014